CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/ParScale/cfdemSolverPisoSTM/packedBedTempParScale/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPisoSTM;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;//1.5;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 0.1;

maxDeltaT       1;

//libs ( "libgroovyBC.so" );
//#include "libsAndFunctionsOF3x"
//#include "libsAndFunctionsOF4x"
#include "libsAndFunctionsOF5x"
